+TITLE: MABS
#+PROPERTY: header-args    :results output :noweb yes
** Environment and MediaWiki export
#+NAME:  repo-dir
#+BEGIN_SRC sh :results output :exports none
/home/mah/repo
#+END_SRC
#+NAME:  local-git
#+BEGIN_SRC sh :results output :exports none
/home/mah/work/code/mediawiki/core
#+END_SRC
#+NAME:  upstream-git
#+BEGIN_SRC sh :results output :exports none
https://gerrit.wikimedia.org/r/mediawiki/core.git
#+END_SRC
#+NAME:  vmpath
#+BEGIN_SRC sh :results output :exports none
/home/mah/MachineImages
#+END_SRC
#+NAME:  debug
#+BEGIN_SRC sh :results output :exports none
y
#+END_SRC
#+NAME:  wiki
#+BEGIN_SRC sh :results output :exports none
mabs
#+END_SRC
#+NAME:  dbname
#+BEGIN_SRC sh :results output :exports none
mabs
#+END_SRC
#+NAME:  dir
#+BEGIN_SRC sh :results output :exports none
/home/mah/client/~{wiki}~
#+END_SRC
#+NAME:  mw-install-path
#+BEGIN_SRC sh :results output :exports none
/home/mah/client/~{wiki}~/mediawiki
#+END_SRC
#+NAME:  host
#+BEGIN_SRC sh :results output :exports none
~{wiki}~.default
#+END_SRC
#+NAME:  hostserver
#+BEGIN_SRC sh :results output :exports none
10.5.5.1
#+END_SRC
#+NAME:  dbserver
#+BEGIN_SRC sh :results output :exports none
10.5.5.1
#+END_SRC
#+NAME:  wikiuser
#+BEGIN_SRC sh :results output :exports none
MarkAHershberger
#+END_SRC
#+NAME:  wikidbuser
#+BEGIN_SRC sh :results output :exports none
wikiuser
#+END_SRC
#+NAME:  wikidbpass
#+BEGIN_SRC sh :results output :exports none
wikipass
#+END_SRC
#+NAME:  wikipass
#+BEGIN_SRC sh :results output :exports none
none1234
#+END_SRC
#+NAME:  wikiserver
#+BEGIN_SRC sh :results output :exports none
http://~{host}~
#+END_SRC
#+NAME:  wikipath
#+BEGIN_SRC sh :results output :exports none
/wiki
#+END_SRC
#+NAME:  relbranch
#+BEGIN_SRC sh :results output :exports none
REL1_31
#+END_SRC

1) Set up =.envrc= get composer.
 #+BEGIN_SRC sh :tangle .envrc
export LOCAL_GIT=~{local-git}~
export UPSTREAM_GIT=~{upstream-git}~
export VMPATH=~{vmpath}~
export DEBUG=~{debug}~
export DIR=~{dir}~
export MW_INSTALL_PATH=~{mw-install-path}~
export WIKI=~{wiki}~
export DBNAME=~{dbname}~
export HOST=~{host}~
export HOSTSERVER=~{hostserver}~
export DBSERVER=~{dbserver}~
export WIKIUSER=~{wikiuser}~
export WIKIDBUSER=~{wikidbuser}~
export WIKIDBPASS=~{wikidbpass}~
export WIKIPASS=~{wikipass}~
export WIKISERVER=~{wikiserver}~
export WIKIPATH=~{wikipath}~
export RELBRANCH=~{relbranch}~
 #+END_SRC

2) check out correct branch
 #+BEGIN_SRC sh :shell bash :tangle setupenv.sh :shebang #!/bin/bash -e
   test -d ~{mw-install-path}~ || git clone ~{local-git}~ ~{mw-install-path}~
   cd ~{mw-install-path}~
   git remote set-url origin ~{upstream-git}~
   git fetch
   branch=`git branch -q | awk '/^\*/ {print $2}'`
   test "$branch" = "~{relbranch}~" || git checkout ~{relbranch}~
   git submodule update --init
   echo on ~{relbranch}~
   cd ~{dir}~
 #+END_SRC

 #+RESULTS:
 : on REL1_31

3) Export this directory via nfs
 #+BEGIN_SRC sh :shell bash :tangle setupenv.sh
   grep -q "~{dir}~" /etc/exports || echo "~{dir}~ *(rw,root_squash,subtree_check)" | sudo tee -a /etc/exports
   sudo exportfs -ra
 #+END_SRC

